Revit 2027 API
MEPCalculationServerInfo.ServerName Property
 The Name of the server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ServerName { get; set; }
Public Property ServerName As String
	Get
	Set
public:
property String^ ServerName {
	String^ get ();
	void set (String^ value);
}
member ServerName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace